In [1]:
import pandas as pd
from fugue_notebook import setup
import seaborn as sns
setup()

In [4]:
df = pd.read_csv('data/insurance.csv')
df.head()

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [14]:
%%fsql
SELECT * FROM df WHERE sex='male' ORDER BY charges DESC LIMIT 5
PRINT

In [16]:
%%fsql
SELECT 
    sex, AVG(bmi) AS avg_bmi 
FROM 
    df 
GROUP BY 
    sex
PRINT

Manual Create

In [17]:
%%fsql
CREATE [[1, 'John', 54], [2, 'Jane', 45]] SCHEMA id:int, name:str, score:float
PRINT

From List

In [18]:
data = [
    [1, 'John', 45.5],
    [2, 'JohnDoe', 45.6],
    [3, 'JohnCa', 45.7],
    [4, 'JohnWay', 45.8],
    [5, 'JohnCane', 45.9],
    [6, 'JohnWayne', 46],
    [7, 'JohnDow', 46.1],
    [8, 'JohnCayne', 46.2],
    [9, 'JohnWy', 46.3],
    [10, 'JohnRu', 46.4],
    [11, 'JohnWitch', 46.5]
]

In [19]:
%%fsql
CREATE {{data}} SCHEMA id:int, name:str, score:float
PRINT

From DataFrame

In [22]:
df_iris = sns.load_dataset('iris')
df_iris.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [27]:
data_iris = df_iris[['petal_width', 'petal_length']].values.tolist()

In [29]:
%%fsql
CREATE {{data_iris}} SCHEMA petal_width:float, petal_length:float

READ DATASET BY THE FUGUESQL

In [4]:
%%fsql
df = LOAD 'data/insurance.csv' (header=TRUE, infer_schema=TRUE)
SELECT * FROM df 
LIMIT 5
PRINT

QUERIES

In [5]:
iris = sns.load_dataset('iris')

In [6]:
%%fsql
SELECT
    petal_length,
    petal_width
FROM
    iris
WHERE
    species='setosa'
LIMIT 5
PRINT

In [7]:
%%fsql
SELECT
    species,
    AVG(petal_length) AS avg_plength,
    AVG(petal_width) AS avg_pwidth
FROM
    iris
GROUP BY
    species
PRINT

In [12]:
df_tips = sns.load_dataset('tips')
df_tips.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  244 non-null    float64
 1   tip         244 non-null    float64
 2   sex         244 non-null    category
 3   smoker      244 non-null    category
 4   day         244 non-null    category
 5   time        244 non-null    category
 6   size        244 non-null    int64
dtypes: category(4), float64(2), int64(1)
memory usage: 7.4 KB

In [14]:
#Convert category to string type for required columns
changed_columns = ['sex', 'smoker', 'day', 'time']
for col in changed_columns:
    df_tips[col] = df_tips[col].astype('str')
df_tips.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  244 non-null    float64
 1   tip         244 non-null    float64
 2   sex         244 non-null    object
 3   smoker      244 non-null    object
 4   day         244 non-null    object
 5   time        244 non-null    object
 6   size        244 non-null    int64
dtypes: float64(2), int64(1), object(4)
memory usage: 13.5+ KB

In [17]:
%%fsql
SELECT 
    * 
FROM 
    df_tips 
WHERE 
    sex='Female' AND 
    smoker='Yes'
PRINT

In [20]:
%%fsql
SELECT 
    sex,
    smoker,
    AVG(tip) AS avg_tip,
    COUNT(*) AS count
FROM 
    df_tips 
GROUP BY
    sex, smoker
PRINT

In [30]:
%%fsql
SELECT 
    * 
FROM 
    df_tips 
WHERE 
    sex='Female' AND 
    smoker='Yes'
ORDER BY
    total_bill DESC
LIMIT
    5
PRINT

In [31]:
%%fsql
SELECT
    MAX(total_bill)
FROM
    df_tips
PRINT

In [32]:
%%fsql
SELECT
    day,
    SUM(tip) AS sum_tip,
    SUM(total_bill) AS sum_total_bill
FROM
    df_tips
GROUP BY
    day
PRINT

In [33]:
%%fsql
SELECT
    day,
    SUM(tip) AS sum_tip,
    SUM(total_bill) AS sum_total_bill
FROM
    df_tips
GROUP BY
    day
HAVING
    SUM(total_bill) <= 1000
PRINT

WINDOW FUNCTION

In [35]:
%%fsql
SELECT
    total_bill,
    SUM(total_bill) OVER() AS sum_total_bill,
    tip,
    SUM(tip) OVER() AS sum_tip
FROM
    df_tips
LIMIT 9
PRINT

In [38]:
%%fsql
SELECT
    sex,
    total_bill,
    SUM(total_bill) OVER(PARTITION BY sex) AS sum_total_bill
FROM
    df_tips
LIMIT 9
PRINT

VARIABLE FUGUESQL

    Python Variable

In [52]:
df = pd.read_csv('data/insurance.csv')
age = 20

In [53]:
%%fsql
SELECT 
    * 
FROM 
    df 
WHERE 
    age <= {{age}}
LIMIT 5
PRINT

        Local Variable

In [59]:
%%fsql
df_female = SELECT * FROM df WHERE sex='female'
df_female_smoker = SELECT * FROM df_female WHERE smoker='yes'
PRINT df_female_smoker

In [43]:
%%fsql
df_female = SELECT * FROM df WHERE sex='female'
SELECT * FROM df_female WHERE age <= {{age}}
LIMIT 5
PRINT

        Global Variable

In [60]:
iris = sns.load_dataset('iris')

In [61]:
%%fsql
SELECT * FROM iris
WHERE
    species='setosa'
YIELD DATAFRAME AS mydata

In [62]:
%%fsql
SELECT * FROM mydata 
WHERE petal_width=0.2
LIMIT 5
PRINT

In [63]:
df = mydata.as_pandas()

In [64]:
df.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [67]:
%%fsql
SELECT * FROM df_tips
WHERE
    sex='Female'
YIELD DATAFRAME AS df_female

In [68]:
%%fsql
SELECT * FROM df_female
WHERE
    smoker='Yes'
YIELD DATAFRAME AS female_smoker

In [71]:
df_female_smoker_pandas = female_smoker.as_pandas()
df_female_smoker_pandas.head()

    total_bill   tip     sex smoker  day    time  size
67        3.07  1.00  Female    Yes  Sat  Dinner     1
72       26.86  3.14  Female    Yes  Sat  Dinner     2
73       25.28  5.00  Female    Yes  Sat  Dinner     2
92        5.75  1.00  Female    Yes  Fri  Dinner     2
93       16.32  4.30  Female    Yes  Fri  Dinner     2

        Change data type of the column

In [74]:
titanic = sns.load_dataset('titanic')
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [75]:
columns = ['class', 'deck']
for col in columns:
    titanic[col] = titanic[col].astype('str')
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    object
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         891 non-null    object
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), float64(2), int64(4), object(7)
memory usage: 92.4+ KB

RENAME COLUMN

In [82]:
%%fsql
df1 = SELECT * FROM titanic
df2 = RENAME COLUMNS sex:gender FROM df1
PRINT df2

CHANGE DATATYPE

In [83]:
%%fsql
df1 = SELECT * FROM titanic
df2 = ALTER COLUMNS survived:int, pclass:int, age:float FROM df1
PRINT df2

DROP COLUMN

In [84]:
%%fsql
df1 = SELECT * FROM titanic
df2 = DROP COLUMNS class, who, deck, embark_town IF EXISTS FROM df1
PRINT df2

CHANGE STRUCTURE OF THE TABLE

In [88]:
%%fsql
df1 = SELECT * FROM titanic
SELECT * FROM df1 WHERE age IS NULL
PRINT 2 ROW
df2 = DROP ROWS IF ANY NULL ON age FROM df1
SELECT * FROM df2 WHERE age IS NULL
PRINT